lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/codec/wm8904/fsl_wm8904.c
    switch (ratio)
    {
        case 64:
            regFsRatio = kWM8904_FsRatio64X;
            break;
        case 128:
            regFsRatio = kWM8904_FsRatio128X;
            break;
        case 192:
            regFsRatio = kWM8904_FsRatio192X;
            break;
        case 256:
            regFsRatio = kWM8904_FsRatio256X;
            break;
        case 384:
            regFsRatio = kWM8904_FsRatio384X;
            break;
        case 512:
            regFsRatio = kWM8904_FsRatio512X;
            break;
        case 768:
            regFsRatio = kWM8904_FsRatio768X;
            break;
        case 1024:
            regFsRatio = kWM8904_FsRatio1024X;
            break;
        case 1408:
            regFsRatio = kWM8904_FsRatio1408X;
            break;
        case 1536:
            regFsRatio = kWM8904_FsRatio1536X;
            break;
        default:
            error = kStatus_WM8904_Fail;
            break;
    }

    if (error == kStatus_WM8904_Success)
    {
        if (kStatus_WM8904_Success == WM8904_UpdateFormat(handle, regFsRatio, regSamplerate, regBitWidth))
        {
            /* check codec in master or not */
            error = WM8904_ReadRegister(handle, WM8904_AUDIO_IF_1, &tempReg);
            if (kStatus_WM8904_Success == error)
            {
                if ((tempReg & (1UL << 6U)) != 0U)
                {
                    error = WM8904_SetMasterClock(handle, sysclk, sampleRate, bitWidth);
                }
            }
        }
    }

    return error;
}

/*!
 * brief Sets the headphone output volume.
 *
 * The parameter should be from 0 to 63.
 * The resulting volume will be (parameter - 57 dB).
 * 0 for -57 dB, 57 for 0 dB, 63 for +6 dB etc.
 *
 * param handle WM8904 handle structure.
 * param volumeLeft Volume of the left channel.
 * param volumeRight Volume of the right channel.
 *
 * return kStatus_WM8904_Success if successful, different code otherwise.
 */
status_t WM8904_SetVolume(wm8904_handle_t *handle, uint16_t volumeLeft, uint16_t volumeRight)
{
    assert(volumeRight <= WM8904_MAP_HEADPHONE_LINEOUT_MAX_VOLUME);
    assert(volumeLeft <= WM8904_MAP_HEADPHONE_LINEOUT_MAX_VOLUME);

    status_t result = kStatus_Success;

    /* 0x1BF means unmute the OUT and reset the OUT volume update bit and volume range fields*/
    result = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT1_LEFT, 0x1BF, volumeLeft);
    if (result != kStatus_WM8904_Success)
    {
        return result;
    }

    result = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT1_RIGHT, 0x1BFU, ((uint16_t)volumeRight | 0x0080U));
    if (result != kStatus_WM8904_Success)
    {
        return result;
    }

    return kStatus_WM8904_Success;
}

/*!
 * brief Sets the headphone output mute.
 *
 * param handle WM8904 handle structure.
 * param muteLeft true to mute left channel, false to unmute.
 * param muteRight true to mute right channel, false to unmute.
 *
 * return kStatus_WM8904_Success if successful, different code otherwise.
 */
status_t WM8904_SetMute(wm8904_handle_t *handle, bool muteLeft, bool muteRight)
{
    status_t result = kStatus_Success;
    uint16_t left   = (uint16_t)(muteLeft ? 0x0100U : 0x0000U);
    uint16_t right  = (uint16_t)(muteRight ? 0x0100U : 0x0000U);

    result = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT1_LEFT, 0x0100, left);
    if (result != kStatus_WM8904_Success)
    {
        return result;
    }

    result = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT1_RIGHT, 0x0180U, ((uint16_t)right | 0x0080U));
    if (result != kStatus_WM8904_Success)
    {
        return result;
    }

    return kStatus_WM8904_Success;
}

#if WM8904_DEBUG_REGISTER
/*!
 * brief Reads content of all WM8904 registers and prints it to debug console.
 *
 * param handle WM8904 handle structure.
 *
 * return kStatus_WM8904_Success if successful, different code otherwise.
 */
status_t WM8904_PrintRegisters(wm8904_handle_t *handle)
{
    status_t result = kStatus_Success;
    uint16_t value;
    uint32_t i;

    for (i = 0; i < sizeof(allRegisters); i++)
    {
        result = WM8904_ReadRegister(handle, allRegisters[i], &value);
        if (result != kStatus_WM8904_Success)
        {
            PRINTF("\r\n");
            return result;
        }
        PRINTF("%s", ((i % 8) == 0) ? "\r\n" : "\t");
        PRINTF("%02X:%04X", allRegisters[i], value);
    }

    PRINTF("\r\n");
    return result;
}
#endif

/*!
 * brief Sets the channel output volume.
 *
 * The parameter should be from 0 to 63.
 * The resulting volume will be.
 * 0 for -57dB, 63 for 6DB.
 *
 * param handle codec handle structure.
 * param channel codec channel.
 * param volume volume value from 0 -63.
 *
 * return kStatus_WM8904_Success if successful, different code otherwise.
 */
status_t WM8904_SetChannelVolume(wm8904_handle_t *handle, uint32_t channel, uint32_t volume)
{
    assert(volume <= WM8904_MAP_HEADPHONE_LINEOUT_MAX_VOLUME);

    status_t ret = kStatus_Fail;

    /* headphone left channel
     *  0x1BF means unmute the OUT and reset the OUT volume update bit and volume range fields
     */
    if ((channel & (uint32_t)kWM8904_HeadphoneLeft) != 0U)
    {
        ret = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT1_LEFT, 0x1BFU, (uint16_t)volume | 0x80U);
    }
    /* headphone right channel */
    if ((channel & (uint32_t)kWM8904_HeadphoneRight) != 0U)
    {
        ret = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT1_RIGHT, 0x1BFU, ((uint16_t)volume | 0x80U));
    }
    /* line out left channel */
    if ((channel & (uint32_t)kWM8904_LineoutLeft) != 0U)
    {
        ret = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT2_LEFT, 0x1BFU, (uint16_t)volume | 0X80U);
    }
    /* line out right channel */
    if ((channel & (uint32_t)kWM8904_LineoutRight) != 0U)
    {
        ret = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT2_RIGHT, 0x1BFU, (uint16_t)volume | 0x80U);
    }

    return ret;
}

/*!
 * brief Sets the channel mute.
 *
 * param handle codec handle structure.
 * param channel codec module name.
 * param isMute true is mute, false unmute.
 *
 * return kStatus_WM8904_Success if successful, different code otherwise.
 */
status_t WM8904_SetChannelMute(wm8904_handle_t *handle, uint32_t channel, bool isMute)
{
    status_t ret      = kStatus_Fail;
    uint16_t regValue = 0U, regMask = 0U;

    regValue = isMute ? 0x180U : 0x80U;
    regMask  = 0x100U;

    /* headphone left channel */
    if ((channel & (uint32_t)kWM8904_HeadphoneLeft) != 0U)
    {
        ret = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT1_LEFT, regMask, regValue);
    }

    /* headphone right channel */
    if ((channel & (uint32_t)kWM8904_HeadphoneRight) != 0U)
    {
        ret = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT1_RIGHT, regMask, regValue);
    }

    /* line out left channel */
    if ((channel & (uint32_t)kWM8904_LineoutLeft) != 0U)
    {
        ret = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT2_LEFT, regMask, regValue);
    }

    /* line out right channel */
    if ((channel & (uint32_t)kWM8904_LineoutRight) != 0U)
    {
        ret = WM8904_ModifyRegister(handle, WM8904_ANALOG_OUT2_RIGHT, regMask, regValue);
    }

    return ret;
}

/*!
 * brief SET the DAC module volume.
 *
 * param handle WM8904 handle structure.
 * param volume volume to be configured.
 *
 * return kStatus_WM8904_Success if successful, different code otherwise..
 */
status_t WM8904_SetDACVolume(wm8904_handle_t *handle, uint8_t volume)
{
    status_t error = kStatus_WM8904_Success;

    error = WM8904_WriteRegister(handle, WM8904_DAC_DIGITAL_VOLUME_LEFT, (uint16_t)(volume | 0x100UL));
    if (error == kStatus_WM8904_Success)
    {
        error = WM8904_WriteRegister(handle, WM8904_DAC_DIGITAL_VOLUME_RIGHT, (uint16_t)(volume | 0x100UL));
    }

    return error;
}

/*!
 * brief SET the module output power.
 *
 * param handle WM8904 handle structure.
 * param module wm8904 module.
 * param isEnabled, true is power on, false is power down.
 *
 * return kStatus_WM8904_Success if successful, different code otherwise..
 */
status_t WM8904_SetModulePower(wm8904_handle_t *handle, wm8904_module_t module, bool isEnabled)
{
    uint8_t regAddr = 0, regBitMask = 0U, regValue = 0U;
    status_t error = kStatus_WM8904_Success;

